tests/data/pgbench_pd_5.txt
pgbench (15.4 (Ubuntu 15.4-0ubuntu0.23.04.1), server 11.9)
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: extended
number of clients: 10
number of threads: 10
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 2792
number of failed transactions: 0 (0.000%)
latency average = 215.602 ms
average connection time = 45.093 ms
tps = 46.381754 (including reconnection times)
statement latencies in milliseconds and failures:
         0.003           0  \set aid random(1, 100000 * :scale)
         0.001           0  \set bid random(1, 1 * :scale)
         0.001           0  \set tid random(1, 10 * :scale)
         0.001           0  \set delta random(-5000, 5000)
        10.800           0  BEGIN;
        11.522           0  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
        10.820           0  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
        42.090           0  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
        73.653           0  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
        10.838           0  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        10.660           0  END;
pgbench (15.4 (Ubuntu 15.4-0ubuntu0.23.04.1), server 11.9)
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: extended
number of clients: 30
number of threads: 10
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 2326
number of failed transactions: 0 (0.000%)
latency average = 782.457 ms
average connection time = 45.695 ms
tps = 38.340765 (including reconnection times)
statement latencies in milliseconds and failures:
         0.003           0  \set aid random(1, 100000 * :scale)
         0.001           0  \set bid random(1, 1 * :scale)
         0.001           0  \set tid random(1, 10 * :scale)
         0.001           0  \set delta random(-5000, 5000)
        11.862           0  BEGIN;
        15.971           0  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
        14.276           0  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
       482.207           0  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
       184.135           0  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
        13.286           0  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        10.687           0  END;
pgbench (15.4 (Ubuntu 15.4-0ubuntu0.23.04.1), server 11.9)
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: extended
number of clients: 50
number of threads: 10
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 2282
number of failed transactions: 0 (0.000%)
latency average = 1341.323 ms
average connection time = 45.764 ms
tps = 37.276631 (including reconnection times)
statement latencies in milliseconds and failures:
         0.003           0  \set aid random(1, 100000 * :scale)
         0.001           0  \set bid random(1, 1 * :scale)
         0.001           0  \set tid random(1, 10 * :scale)
         0.001           0  \set delta random(-5000, 5000)
        13.212           0  BEGIN;
        16.939           0  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
        14.532           0  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
      1007.571           0  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
       205.096           0  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
        13.577           0  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        10.683           0  END;
pgbench (15.4 (Ubuntu 15.4-0ubuntu0.23.04.1), server 11.9)
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: extended
number of clients: 100
number of threads: 10
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 2338
number of failed transactions: 0 (0.000%)
latency average = 2658.941 ms
average connection time = 45.757 ms
tps = 37.608956 (including reconnection times)
statement latencies in milliseconds and failures:
         0.003           0  \set aid random(1, 100000 * :scale)
         0.001           0  \set bid random(1, 1 * :scale)
         0.001           0  \set tid random(1, 10 * :scale)
         0.001           0  \set delta random(-5000, 5000)
        19.869           0  BEGIN;
        21.864           0  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
        14.897           0  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
      2255.113           0  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
       224.613           0  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
        13.456           0  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        10.684           0  END;
pgbench (15.4 (Ubuntu 15.4-0ubuntu0.23.04.1), server 11.9)
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: extended
number of clients: 300
number of threads: 10
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 2420
number of failed transactions: 0 (0.000%)
latency average = 8272.589 ms
average connection time = 46.216 ms
tps = 36.264343 (including reconnection times)
statement latencies in milliseconds and failures:
         0.003           0  \set aid random(1, 100000 * :scale)
         0.001           0  \set bid random(1, 1 * :scale)
         0.001           0  \set tid random(1, 10 * :scale)
         0.001           0  \set delta random(-5000, 5000)
        94.643           0  BEGIN;
        24.922           0  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
        15.088           0  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
      7330.386           0  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
       235.766           0  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
        13.716           0  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        10.802           0  END;
pgbench (15.4 (Ubuntu 15.4-0ubuntu0.23.04.1), server 11.9)
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: extended
number of clients: 500
number of threads: 10
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 2582
number of failed transactions: 0 (0.000%)
latency average = 13801.968 ms
average connection time = 46.338 ms
tps = 36.226718 (including reconnection times)
statement latencies in milliseconds and failures:
         0.003           0  \set aid random(1, 100000 * :scale)
         0.001           0  \set bid random(1, 1 * :scale)
         0.001           0  \set tid random(1, 10 * :scale)
         0.001           0  \set delta random(-5000, 5000)
       248.287           0  BEGIN;
        85.777           0  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
        19.075           0  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
     11825.772           0  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
       231.585           0  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
        13.305           0  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        11.370           0  END;